

create database botola_maghribiya; 
use botola_maghribiya;


CREATE TABLE users (
  id INT AUTO_INCREMENT PRIMARY KEY,
  username VARCHAR(100) NOT NULL,
  email VARCHAR(150) NOT NULL UNIQUE,
  password VARCHAR(255) NOT NULL,
  role ENUM('admin', 'user') DEFAULT 'user',
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);



CREATE TABLE articles (
  id INT AUTO_INCREMENT PRIMARY KEY,
  title VARCHAR(255) NOT NULL,
  author VARCHAR(40) not NULL,
  content TEXT NOT NULL,
  image VARCHAR(255),
  category VARCHAR(50),
  user_id INT,
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  
  FOREIGN KEY (user_id) REFERENCES users(id) ON DELETE CASCADE
);







CREATE TABLE comments (
  id INT AUTO_INCREMENT PRIMARY KEY,
  article_id INT NOT NULL,
  username VARCHAR(100),
  comment TEXT NOT NULL,
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,

  FOREIGN KEY (article_id) REFERENCES articles(id) ON DELETE CASCADE
);




INSERT INTO articles (title, author, content, image, category, user_id) values  

("لتعادل السلبي يحسم مواجهة اتحاد طنجة والجيش الملكي بملعب طنجة الكبير",
"Hassan","حسم التعادل السلبي نتيجة المباراة التي جمعت نادي اتحاد طنجة بضيفه الجيش الملكي، مساء يومه الأحد، على أرضية ملعب طنجة الكبير، ضمن منافسات الجولة 18 من البطولة الاحترافية.

وانتهى الشوط الأول على نتيجة البياض رغم المحاولات المتبادلة من الجانبين، حيث سعى كل طرف لافتتاح حصة التسجيل مبكرا وأخذ الأسبقية، غير أن الحذر الدفاعي طغى على معظم فترات هذا الشوط.

وخلال الشوط الثاني، ارتفع نسق اللقاء، وشهد محاولات جادة من الطرفين لفك شفرة الدفاع، غير أن تألق حارسي الفريقين ويقظتهما حالا دون بلوغ أي طرف الشباك، لتنتهي المباراة بنتيجة البياض 0-0.

وبعد هذا التعادل، أضاف كل فريق نقطة واحدة لرصيده، حيث أصبح رصيد اتحاد طنجة 18 نقطة في المركز 11، بينما ارتقى الجيش الملكي للمركز الثاني مناصفة مع الرجاء الرياضي برصيد 36 نقطة، مع أفضلية للجيش بفضل فارق الأهداف." ,"tanger.jpeg" ,"news" , 1) ,

("الرجاء الرياضي يهزم المغرب الفاسي بثنائية وينتزع صدارة البطولة مؤقتا" ,
"Hassan" , "فريق الرجاء الرياضي في العودة بانتصار ثمين من قلب فاس، عقب تغلبه على مضيفه المغرب الرياضي الفاسي بهدفين دون رد، في المواجهة التي جمعتهما مساء يومه الأربعاء على أرضية المركب الرياضي بفاس، لحساب منافسات الجولة التاسعة عشرة من البطولة الاحترافية.

وأنهى الفريق “الأخضر” الفصل الأول من اللقاء متفوقا بهدف نظيف وقعه المهاجم النيجيري ماتياس أوييووسي عند الدقيقة 19.

وشهد هذا الشوط ندية كبيرة وصراعا قويا بين الطرفين على مستوى وسط الميدان، مع رغبة واضحة من الجانبين في فرض السيطرة.

وواصل الرجاء عرضه القوي خلال الشوط الثاني، حيث تمكن من تعزيز تقدمه بهدف ثان في الدقيقة 53 بعد ركنية نفذها صابر بوغرين، استقرت أمام أيوب العملود الذي أودعها الشباك مستغلا ارتباكا في دفاع المغرب الفاسي.

وبعد تلقيه الهدف الثاني، حاول المغرب الفاسي بشتى الطرق للعودة في النتيجة وتقليص الفارق، حيث تحصل على ضربة جزاء في 87، غير أن الحكم ألغاها بعد العودة لتقنية الفيديو “الفار”، لتنتهي المواجهة بتفوق الضيوف بنتيجة هدفين لصفر.

وعقب هذا الفوز خارج الديار، ارتقى الرجاء الرياضي إلى صدارة البطولة الاحترافية مؤقتا برصيد تسع وثلاثين نقطة، في حين تجمد رصيد المغرب الفاسي عند النقطة الثامنة والثلاثين، متراجعا بذلك إلى المركز الثاني في جدول الترتيب." ,
"A1.jpg", "news" ,"1") ,


("فوز مثير للجيش أمام حسنية أكادير" , "Hassan" ,"قق الجيش الملكي فوزا مثيرا على حساب مضيفه حسنية أكادير بثلاثة أهداف لهدفين، في المباراة التي جمعتهما مساء يوم الأحد على أرضية ملعب أدرار، لحساب الجولة 20 من منافسات البطولة الاحترافية.

ودخل الفريق العسكري المباراة بقوة، حيث افتتح جلال الدين الخفيف التسجيل مبكرا في الدقيقة السابعة، مانحا التقدم للضيوف منذ البداية.

ولم تدم فرحة الجيش طويلا، بعدما أعاد الموريتاني محمد نوح المباراة إلى نقطة الصفر بتسجيله هدفا ضد مرماه في الدقيقة التاسعة، مانحا التعادل لحسنية أكادير.

واستمرت المحاولات من الجانبين خلال الشوط الأول، قبل أن يعود جلال الدين الخفيف لهز الشباك مجددا في الدقيقة 39، مسجلا الهدف الثاني للفريق العسكري والثاني الشخصي له في اللقاء.

ورد أصحاب الأرض سريعا، إذ تمكن البرتغالي أوكلوديس كابرال من تعديل الكفة للحسنية في الدقيقة 42، لينتهي الشوط الأول على إيقاع التعادل بهدفين لمثلهما.

وخلال الجولة الثانية، حاول مدربا الفريقين البحث عن هدف الانتصار عبر مجموعة من التغييرات، غير أن الفعالية الهجومية غابت عن أغلب المحاولات، في شوط اتسم بالحذر والتوازن.

وفي الوقت بدل الضائع، وتحديدا في الدقيقة 91، تحصل الجيش الملكي على ضربة جزاء ترجمها العميد محمد ربيع حريمات بنجاح إلى هدف قاتل، مانحا فريقه ثلاث نقاط ثمينة.

وبهذا الفوز رفع الجيش الملكي رصيده إلى 40 نقطة في المركز الثاني، مواصلا مطاردة المتصدر المغرب الفاسي صاحب 41 نقطة، والذي كان قد فاز في وقت سابق اليوم على اتحاد تواركة بهدف دون رد.

في المقابل، تجمد رصيد حسنية أكادير عند 20 نقطة في المركز الثاني عشر.

وتتواصل منافسات الجولة 20 يوم غد الاثنين، بإجراء مباريات أولمبيك آسفي أمام الفتح الرياضي، واتحاد يعقوب المنصور ضد الكوكب المراكشي، ثم نهضة الزمامرة في مواجهة أولمبيك الدشيرة."  , "A2.jpg" , "news" , 1)


("التعادل الإيجابي يحسم مواجهة آسفي والفتح" , "سم التعادل الايجابي مواجهة أولمبيك آسفي وضيفه الفتح الرياضي، بهدف لمثله، في المباراة التي جمعتهما مساء اليوم الإثنين، على أرضية ملعب المسيرة بمدينة آسفي، لحساب الجولة 20 من البطولة الاحترافية.

وأنهى أولمبيك آسفي الشوط الأول متقدما بهدف نظيف، سجله اللاعب فراجي كرمون في الدقيقة 28 عن طريق ضربة جزاء، وخلال الشوط الثاني نجح أيوب مولوعة في إدراك التعادل للفتح الرياضي، في الدقيقة 77، عبر تسديدة مركزة، لتنتهي المواجهة باقتسام النقاط.

وعقب هذه النتيجة، أضاف كل فريق نقطة واحدة إلى رصيده، حيث رفع الفتح الرياضي رصيده إلى 26 نقطة في المركز الثامن، بينما بلغ رصيد أولمبيك آسفي 14 نقطة في المركز 14." ,"A3.jpeg" , "new" ,1),


("بدر بانون يوضح ويعتذر للمسفيويين", "رج بدر بنون، لاعب الرجاء الرياضي لكرة القدم، بتوضيح رسمي عقب الجدل الذي رافق الفيديو المتداول بعد نهاية “الديربي” البيضاوي أمام الوداد الرياضي، والذي ظهر فيه في نقاش مع عبد الغفور لاميرات.

وأكد بانون، عبر “سطوري” بحسابه الرسمي على موقع “إنستغرام”، أن الحديث الذي جمعه بلاميرات كان مرتبطا بسوء تفاهم سابق يعود إلى فترة حمل الأخير لقميص أولمبيك آسفي، مشددا على أن كلامه لم يكن يحمل أي نية للإساءة أو التقليل من قيمة النادي “المسفيوي” أو جماهيره.

وقال مدافع الرجاء: “أكن كامل الاحترام والتقدير لنادي أولمبيك آسفي، ولكافة مكونات المدينة وجمهورها، ولم يسبق لي يوما أن أسأت لأي مدينة أو جمهور أو فريق مغربي”.

وأضاف المتحدث نفسه أن علاقته بمختلف مكونات كرة القدم الوطنية “قائمة على الاحترام المتبادل وروح المنافسة الرياضية”، مبرزا أنه يقدم اعتذاره في حال فُهم كلامه بشكل مغاير أو تسبب في إساءة لأي شخص من أبناء مدينة آسفي.

وفي سياق متصل، كشف بانون أنه باشر صباح اليوم الإجراءات القانونية ضد بعض الصفحات والأشخاص الذين “تجاوزوا حدود النقد الرياضي”، حسب تعبيره، عبر الإساءة والتشهير بعائلته ونشر صور وتعليقات اعتبرها غير مقبولة.

وكانت الواقعة قد أثارت تفاعلا واسعا عقب نهاية مباراة “الديربي” التي حسمها الوداد الرياضي لصالحه بهدف دون رد، ضمن منافسات البطولة الاحترافية." , "A4.jpg", "news" , 1),


('البطولة الاحترافية تشهد منافسة قوية هذا الموسم',
  'Hassan',
  'تواصل البطولة الاحترافية المغربية جذب اهتمام الجماهير هذا الموسم بفضل المباريات القوية والمنافسة الكبيرة بين الأندية على صدارة الترتيب. وشهدت الجولات الأخيرة ارتفاع مستوى الأداء داخل أرضية الملعب، حيث أصبحت الفرق تعتمد على أساليب لعب حديثة وتنظيم تكتيكي واضح، مما جعل المباريات أكثر إثارة وتشويقاً للجماهير المغربية.

ويعتبر هذا الموسم من أكثر المواسم تنافساً، خاصة مع تقارب مستوى الأندية الكبرى مثل الوداد الرياضي والرجاء الرياضي والجيش الملكي ونهضة بركان، حيث تسعى كل الفرق لتحقيق نتائج إيجابية من أجل ضمان المشاركة في المنافسات القارية أو الابتعاد عن مراكز الهبوط. كما برز عدد من اللاعبين الشباب الذين قدموا مستويات رائعة وجذبوا اهتمام الجماهير والمتابعين بفضل مهاراتهم وأهدافهم الحاسمة.

الجماهير المغربية بدورها لعبت دوراً مهماً في نجاح البطولة، إذ شهدت الملاعب حضوراً جماهيرياً كبيراً خلق أجواء استثنائية خلال المباريات. وتواصل جماهير الأندية دعم فرقها سواء داخل الملعب أو عبر مواقع التواصل الاجتماعي، ما يعكس الشعبية الكبيرة التي تتمتع بها كرة القدم في المغرب.

من جهة أخرى، تعمل العصبة الاحترافية على تطوير البطولة من خلال تحسين البنية التحتية للملاعب وتشجيع الأندية على الاعتماد على التكوين وإعطاء الفرصة للمواهب الشابة. كما تسعى الأندية إلى تحسين نتائجها القارية من أجل تمثيل كرة القدم المغربية بأفضل صورة ممكنة على المستوى الإفريقي.

ومع استمرار المنافسة وارتفاع مستوى الحماس، ينتظر عشاق الكرة المغربية المزيد من المباريات القوية واللحظات المثيرة خلال الجولات القادمة من البطولة الاحترافية.',
  'botola-maroc.jpg',
  'news',
  1
);

